#include "stm32f10x.h"
void SystemInit (void)
{

}

int main(void)
{
    
    //開啟GPIOC時鐘
    RCC_APB2ENR |= ((1)<<4);
    
    /************************************
     * 清除PC13 GPIO pin腳狀態          
     * GPIO_CRH 為GPIO配置高寄存器      
     *                                  
     * 每組GPIO共有16腳，CRH管8~15        
     * CRL管0~7
     * 每四位元為一管腳狀態
     * 
     * CNF[1:0],MODE[1:0]
     * MODE = 00 輸入模式
     *        01 輸出模式，速度上限10MHz
     *        10 輸出模式，速度上限2MHz
     *        11 輸出模式，速度上限50MHz
     * 當MODE=00時，
     * CNF = 00 類比輸入
     *       01 浮空輸入
     *       10 上拉/下拉輸入
     *       11 RFU
     * 當MODE!=00時，
     * CNF = 00 通用推挽輸出
     *       01 通用開漏輸出
     *       10 複用推挽輸出
     *       11 複用開漏輸出
     * 
     ************************************/
    GPIOC_CRH &= ~((0x0F)<<(4*5));
    
    //配置PC13為10MHz推挽輸出
    GPIOC_CRH |=((1)<<(4*5));

    //PC13輸出低電平
    GPIOC_ODR |=((0)<<13);



    /* 最直接的寫法，透過開發手冊得知寄存器地址
    *(unsigned int *)0x40021018 |= ((1)<<4);
    *(unsigned int *)0x40011004 &= ~((0x0f)<<(4*5));
    *(unsigned int *)0x40011004 |= ((1)<<(4*5));
    *(unsigned int *)0x4001100C |= ~((1)<<13);
    */           

   
    while (1);
        
}
